In [1]:
import pandas as pd

In [2]:
p1 = pd.read_csv("test.csv")

In [3]:
p1

       Name  age
0   apeksha   30
1     anaya    3
2  mahendra   35
3    shital   28
4     vilas   26

In [4]:
p1['age'].count()

5

In [5]:
p1['Name'].max()

'vilas'

In [6]:
p1.shape

(5, 2)

In [13]:
p1.groupby(['age']).groups.values()

dict_values([Int64Index([1], dtype='int64'), Int64Index([4], dtype='int64'), Int64Index([3], dtype='int64'), Int64Index([0], dtype='int64'), Int64Index([2], dtype='int64')])

In [9]:
p1.groupby(['age']).groups.keys()

dict_keys([3, 26, 28, 30, 35])

In [15]:
p1.groupby('Name')['age'].sum()

Name
anaya        3
apeksha     30
mahendra    35
shital      28
vilas       26
Name: age, dtype: int64

In [16]:
p2 = pd.read_csv("test2.csv")

In [17]:
p2

   no      name  age    hobby
0   1   apeksha   30    dance
1   2     anaya    3    dance
2   3      baby    3  jumping
3   4  mahendra   35  surfing
4   5     vilas   26  surfing

In [18]:
p2.groupby('age')

In [19]:
p2.groupby('hobby')['no'].sum()

hobby
dance      3
jumping    3
surfing    9
Name: no, dtype: int64

In [36]:
p2.groupby("hobby").agg({"age":[min,max,sum],
                         "name":"count"})

        age          name
        min max sum count
hobby
dance     3  30  33     2
jumping   3   3   3     1
surfing  26  35  61     2

In [46]:
p2.groupby("hobby").agg(
                        max_1=pd.NamedAgg(column="age",aggfunc=max),
                        min_1=pd.NamedAgg(column="age",aggfunc=min),
                        sum_1=("age",sum),
                        sum_2=("age",lambda x: max(x)+10)
                        )

         max_1  min_1  sum_1  sum_2
hobby
dance       30      3     33     40
jumping      3      3      3     13
surfing     35     26     61     45

In [20]:
p2.agg(['sum','min'])

     no                           name  age                            hobby
sum  15  apekshaanayababymahendravilas   97  dancedancejumpingsurfingsurfing
min   1                          anaya    3                            dance

In [21]:
p2

   no      name  age    hobby
0   1   apeksha   30    dance
1   2     anaya    3    dance
2   3      baby    3  jumping
3   4  mahendra   35  surfing
4   5     vilas   26  surfing

In [22]:
p2.agg({'age':['sum','min'],'hobby': ['count']})

        age  hobby
count   NaN    5.0
min     3.0    NaN
sum    97.0    NaN

In [24]:
p2.sort_values(by='age')

   no      name  age    hobby
1   2     anaya    3    dance
2   3      baby    3  jumping
4   5     vilas   26  surfing
0   1   apeksha   30    dance
3   4  mahendra   35  surfing

In [25]:
p2.sort_values(by=['no','name'])

   no      name  age    hobby
0   1   apeksha   30    dance
1   2     anaya    3    dance
2   3      baby    3  jumping
3   4  mahendra   35  surfing
4   5     vilas   26  surfing

In [26]:
p2.sort_index(ascending=False)

   no      name  age    hobby
4   5     vilas   26  surfing
3   4  mahendra   35  surfing
2   3      baby    3  jumping
1   2     anaya    3    dance
0   1   apeksha   30    dance

In [27]:
qual=['BE','KG','KG','BQ','MBA']

In [28]:
p2['qual']=qual

In [29]:
p2

   no      name  age    hobby qual
0   1   apeksha   30    dance   BE
1   2     anaya    3    dance   KG
2   3      baby    3  jumping   KG
3   4  mahendra   35  surfing   BQ
4   5     vilas   26  surfing  MBA

In [30]:
# Using DataFrame.insert() to add a column at any position
p2.insert(2, "hieght", [100, 200, 300, 500,500], True)

In [31]:
p2

   no      name  hieght  age    hobby qual
0   1   apeksha     100   30    dance   BE
1   2     anaya     200    3    dance   KG
2   3      baby     300    3  jumping   KG
3   4  mahendra     500   35  surfing   BQ
4   5     vilas     500   26  surfing  MBA

In [32]:
# Define a dictionary containing Students data 
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']} 
  
# Define a dictionary with key values of 
# an existing column and their respective 
# value pairs as the # values for our new column. 
address = {'Delhi': 'Jai', 'Bangalore': 'Princi', 
           'Patna': 'Gaurav', 'Chennai': 'Anuj'} 
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 
  
# Provide 'Address' as the column name 
df['Address'] = address 
  
# Observe the output 
df

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc      Patna
3    Anuj     5.2           Msc    Chennai

In [33]:
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']} 
   
   
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 
  
# Using 'Address' as the column name and equating it to the list 
df2 = df.assign(address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']) 
   
# Observe the result 
df2

     Name  Height Qualification    address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

In [35]:
df2.drop(['address'],axis=1)

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           Msc
3    Anuj     5.2           Msc

In [36]:
df2

     Name  Height Qualification    address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

In [50]:
#all columns between column index 1 to 3 
df.iloc[0:1, 1:3]

   Height Qualification
0     5.1           Msc

In [51]:
display(df)

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           Msc
3    Anuj     5.2           Msc

In [46]:
df.loc[0:2, 'Name']

0       Jai
1    Princi
2    Gaurav
Name: Name, dtype: object

In [58]:
import datetime

x = datetime.datetime.now()
print(x)
print(x.strftime("%A"))
print(x.strftime("%y-%m-%d"))
print(x.strftime("%T"))

2021-02-12 10:12:58.890000
Friday
21-02-12
10:12:58

In [59]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
pd.to_datetime(df)

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]